zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/devices/msp/peripherals/hw_dma.h
/*****************************************************************************

  Copyright (C) 2023 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/
/**
 * @file hw_dma.h
 * @brief DMA直接内存访问控制器寄存器定义
 *
 * 定义MSPM0G3507片上DMA控制器的全部寄存器结构体和位域宏。
 * 提供16个DMA通道，每个通道独立配置源/目标地址、传输大小和触发源。
 * 支持单次传输、块传输、重复单次和重复块四种传输模式。
 * 关键寄存器包括：DMACHAN[16](通道控制/源地址/目标地址/大小)、
 * DMATRIG[16](触发源选择)、DMAPRIO(通道优先级)。
 * 源/目标数据宽度支持8/16/32/64/128位，地址可自动递增/递减/跨步。
 */

#ifndef ti_devices_msp_peripherals_hw_dma__include
#define ti_devices_msp_peripherals_hw_dma__include

/* Filename: hw_dma.h */
/* Revised: 2023-10-18 15:33:13 */
/* Revision: 7d9c399dfeb736b2cd8c73fed58f1ce76b72f726 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* DMA Registers - DMA直接内存访问控制器寄存器组定义
* 包含：16通道DMA控制/源地址/目标地址/大小、触发源选择、通用事件、CPU中断
******************************************************************************/
#define DMA_DMACHAN_OFS                          ((uint32_t)0x00001200U)
#define DMA_DMATRIG_OFS                          ((uint32_t)0x00001110U)
#define DMA_GEN_EVENT_OFS                        ((uint32_t)0x00001050U)
#define DMA_CPU_INT_OFS                          ((uint32_t)0x00001020U)


/** @addtogroup DMA_DMACHAN
  @{
*/

typedef struct {
  __IO uint32_t DMACTL;                            /* !< (@ 0x00001200) DMA Channel Control */
  __IO uint32_t DMASA;                             /* !< (@ 0x00001204) DMA Channel Source Address */
  __IO uint32_t DMADA;                             /* !< (@ 0x00001208) DMA Channel Destination Address */
  __IO uint32_t DMASZ;                             /* !< (@ 0x0000120C) DMA Channel Size */
} DMA_DMACHAN_Regs;

/*@}*/ /* end of group DMA_DMACHAN */

/** @addtogroup DMA_DMATRIG
  @{
*/

typedef struct {
  __IO uint32_t DMATCTL;                           /* !< (@ 0x00001110) DMA Trigger Select */
} DMA_DMATRIG_Regs;

/*@}*/ /* end of group DMA_DMATRIG */

/** @addtogroup DMA_GEN_EVENT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001050) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001058) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001060) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001068) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001070) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001078) Interrupt clear */
} DMA_GEN_EVENT_Regs;

/*@}*/ /* end of group DMA_GEN_EVENT */

/** @addtogroup DMA_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt mask */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) Raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) Masked interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt set */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear */
} DMA_CPU_INT_Regs;

/*@}*/ /* end of group DMA_CPU_INT */

/** @addtogroup DMA
  @{
*/

